Tekla Open API Reference for Tekla Structures 2025
AnalysisModel.AxisLocationEnum Enumeration
 The axis location.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum AxisLocationEnum
Public Enumeration AxisLocationEnum
Members
Member name | Value | Description
REFERENCE_AXIS_WITH_ECCENTRICITY | 0 |  The axis location is the reference axis with eccentricity.
REFERENCE_AXIS | 1 |  The axis location is the reference axis.
MODEL_PART | 2 |  The axis location setting of each part is used.
NEUTRAL_AXIS | 3 |  The axis location is the neutral axis.
See Also
Reference
Tekla.Structures.Analysis Namespace